-- добавим 6 жанров.
INSERT INTO genre(genre_title) 
VALUES
    ('Поп'), --1
    ('Шансон'), --2
    ('Джаз'), --3
    ('Рок'), --4
    ('хип-хоп'), --5
    ('Элкетро-хоп-рок'); --6

-- добавим 8 artists.
INSERT INTO artist(artist_name) 
VALUES
    ('Макс Корж'),  --1
    ('Виктор Цой'), --2
    ('Нюша'), --3
    ('Михаил Шуфутинский'), --4
    ('Луи Дэниел Армстронг'), --5
    ('Depeche Mode'), --6
    ('Modern Talking'), --7
    ('Полина Гагарина'); --8

-- добавим таблицы связей.
INSERT INTO genre_artist(id_artist, id_genre) 
VALUES
    (1, 1),
    (1, 5),
    (2, 4),
    (2, 1),
    (3, 1),
    (3, 4,) 