-- добавим 6 жанров.
INSERT INTO genre(genre_title) 
VALUES
    ('Поп'), --1
    ('Шансон'), --2
    ('Джаз'), --3
    ('Рок'), --4
    ('хип-хоп'), --5
    ('Элкетро-хоп-рок'); --6

-- добавим 8 artists.
INSERT INTO artist(artist_name) 
VALUES
    ('Макс Корж'),  --1
    ('Виктор Цой'), --2
    ('Нюша'), --3
    ('Михаил Шуфутинский'), --4
    ('Луи Дэниел Армстронг'), --5
    ('Depeche Mode'), --6
    ('Modern Talking'), --7
    ('Полина Гагарина'); --8


-- добавим 8 альбомов.
INSERT INTO album(album_title, year_of_releas) 
VALUES
    ('Животный мир', 2012), --1
    ('Группа крови1', 1988), --2
    ('Выбирать чудо', 2010), --3
    ('Перекрестки', 1998), --4
    ('What a Wonderful World', 1967), --5
    ('Black Celebration', 1986), --6
    ('Back for Good', 1998),  --7
    ('Попроси у облаков', 2007); --8


-- добавим 16 стр в таблицы связей.
INSERT INTO genre_artist(id_artist, id_genre) 
VALUES
    (1, 1),
    (1, 5),
    (2, 4),
    (2, 1),
    (3, 1),
    (3, 4),
    (4, 2),
    (4, 5),
    (5, 1),
    (5, 3),
    (6, 6),
    (6, 4),
    (7, 1),
    (7, 3),
    (8, 1),
    (8, 4);


-- добавим 8 записей в таблицы связей.
INSERT INTO album_artist(id_artist, id_album) 
VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5),
    (6, 6),
    (7, 7),
    (8, 8);

-- добавим 8 сборников.
INSERT INTO collection(collection_title, release_year) 
VALUES
    ('Небо поможет нам', 2012), --1
    ('Любовь — это не шутка', 2020), --2
    ('сборник', 2037), --3
    ('Золотой альбом', 2008), --4
    ('What a Wonderful World', 1998), --5
    ('Greatest Hits', 1987), --6
    ('The Collection', 1991), --7
    ('Morning', 2006); --8

-- добавим 16 треков.
INSERT INTO track(id_album, track_title, duration) 
VALUES
    (1, 'Привет всем!', '00:01:06'), --1
    (1, 'Небо поможет нам', '00:03:28'), --2
    (2, 'Дальше действовать будем мы', '00:03:57'), --3
    (2, 'Закрой за мной дверь я ухожу', '00:03:58'), --4
    (3, 'Выбирать чудо', '00:04:27'), --5
    (3, 'Выше', '00:03:57'), --6
    (4, 'Марина', '00:03:30'), --7
    (4, 'Перекрестки', '00:03:38'), --8
    (5, 'What a Wonderful World', '00:02:21'), --9
    (5, 'Hello, Dolly!', '00:02:27'), --10
    (6, 'A Question of Lust', '00:04:20'), --11
    (6, 'Black Celebration', '00:04:55'), --12
    (7, 'We Take the Chance', '00:04:06'), --13
    (7, 'You Can Win If You Want', '00:03:40'), --14
    (8, 'Ветер', '00:03:37'), --15
    (8, 'Don"t Waste Your Time', '00:03:05'); --16

-- добавим 16 стр в таблицы связей.
INSERT INTO track_collection(id_collection,	id_track) 
VALUES
    (1, 1),
    (1, 2),
    (2, 3),
    (2, 4),
    (3, 5),
    (3, 6),
    (4, 7),
    (4, 8),
    (5, 9),
    (5, 10),
    (6, 11),
    (6, 12),
    (7, 13),
    (7, 14),
    (8, 15),
    (8, 16);

